/*
SQLyog Ultimate v10.00 Beta1
MySQL - 5.5.27 : Database - record
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
USE `record`;

/*Table structure for table `account` */

CREATE TABLE `account` (
  `username` varchar(20) NOT NULL COMMENT '用户名',
  `password` varchar(20) NOT NULL COMMENT '用户密码',
  `userlevel` varchar(10) DEFAULT NULL COMMENT '用户类型',
  PRIMARY KEY (`username`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `account` */

insert  into `account`(`username`,`password`,`userlevel`) values ('admin','admin','admin'),('life','life','LIFE'),('study','study','STUDY'),('system','system','SYSTEM'),('work','work','WORK');

/*Table structure for table `diary` */

CREATE TABLE `diary` (
  `diaryid` varchar(20) NOT NULL COMMENT '该信息的唯一标识',
  `createdate` varchar(10) DEFAULT NULL COMMENT '创建日期',
  `createtime` varchar(10) DEFAULT NULL COMMENT '创建时间',
  `diarytitle` varchar(100) DEFAULT NULL COMMENT '该记录的titel',
  `content` mediumtext COMMENT '具体内容',
  `acquire` text COMMENT '当前时间中学到信息',
  `matterId` text COMMENT '事情id关联表',
  `RESUMEId` varchar(20) DEFAULT NULL COMMENT '包含人物信息，关联表',
  `remark` text COMMENT '备注信息',
  PRIMARY KEY (`diaryid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `diary` */

insert  into `diary`(`diaryid`,`createdate`,`createtime`,`diarytitle`,`content`,`acquire`,`matterId`,`RESUMEId`,`remark`) values ('1','20171213','155700','道德经','01.道可道，非常道。名可名，非常名。无名天地之始。有名万物之母。故常无欲以观其妙。常有欲以观其徼。此两者同出而异名，同谓之玄。玄之又玄，众妙之门。\r\n02.天下皆知美之为美，斯恶矣；皆知善之为善，斯不善已。故有无相生，难易相成，长短相形，高下相倾，音声相和，前後相随。是以圣人处无为之事，行不言之教。万物作焉而不辞。生而不有，为而不恃，功成而弗居。夫唯弗居，是以不去。\r\n03.不尚贤， 使民不争。不贵难得之货，使民不为盗。不见可欲，使民心不乱。是以圣人之治，虚其心，实其腹，弱其志，强其骨；常使民无知、无欲，使夫智者不敢为也。为无为，则无不治。\r\n04.道冲而用之，或不盈。渊兮似万物之宗。解其纷，和其光，同其尘，湛兮似或存。吾不知谁之子，象帝之先。\r\n05.天地不仁，以万物为刍狗。圣人不仁，以百姓为刍狗。天地之间，其犹橐迭乎？虚而不屈，动而愈出。多言数穷，不如守中。\r\n06.谷神不死是谓玄牝。玄牝之门是谓天地根。绵绵若存，用之不勤。\r\n07.天长地久。天地所以能长且久者，以其不自生，故能长生。是以圣人後其身而身先，外其身而身存。\r\n非以其无私邪！故能成其私。\r\n08.上善若水。水善利万物而不争，处众人之所恶，故几於道。居善地，心善渊，与善仁，言善信，正善\r\n治，事善能，动善时。夫唯不争，故无尤。\r\n09.持而盈之不如其己；揣而锐之不可长保；金玉满堂莫之能守；富贵而骄，自遗其咎。功遂身退，天之\r\n道。\r\n10.载营魄抱一，能无离乎？专气致柔，能如婴儿乎？涤除玄览，能无疵乎？爱国治民，能无为乎？天门\r\n开阖，能为雌乎？明白四达，能无知乎。\r\n11.三十幅共一毂，当其无，有车之用。埏埴以为器，当其无，有器之用。凿户牖以为室，当其无，有室\r\n之用。故有之以为利，无之以为用。\r\n \r\n12.五色令人目盲，五音令人耳聋，五味令人口爽，驰骋畋猎令人心发狂，难得之货令人行妨。是以圣人\r\n，为腹不为目，故去彼取此。\r\n \r\n13.宠辱若惊，贵大患若身。何谓宠辱若惊？宠为下。得之若惊失之若惊是谓宠辱若惊。何谓贵大患若身\r\n？吾所以有大患者，为吾有身，及吾无身，吾有何患。故贵以身为天下，若可寄天下。爱以身为天下，若\r\n可托天下。\r\n \r\n14.视之不见名曰夷。听之不闻名曰希。抟之不得名曰微。此三者不可致诘，故混而为一。其上不皦\r\n，其下不昧，绳绳不可名，复归於无物。是谓无状之状，无物之象，是谓惚恍。迎之不见其首，随\r\n之不见其後。执古之道以御今之有。能知古始，是谓道纪。\r\n\r\n15.古之善为士者，微妙玄通，深不可识。夫唯不可识，故强为之容。豫兮若冬涉川；犹兮若畏四邻；俨\r\n\r\n兮其若容；涣兮若冰之将释；敦兮其若朴；旷兮其若谷；混兮其若浊；澹兮其若海；飉(风的声音)兮\r\n\r\n若无止。孰能浊以静之徐清。孰能安以动之徐生。保此道者不欲盈。夫唯不盈故能蔽而新成。\r\n\r\n \r\n\r\n16.致虚极守静笃。万物并作，吾以观复。夫物芸芸各复归其根。归根曰静，是谓复命；复命曰常，知常\r\n\r\n曰明。不知常，妄作凶。知常容，容乃公，公乃全，全乃天，天乃道，道乃久，没身不殆。\r\n\r\n \r\n\r\n17.太上，下知有之。其次，亲而誉之。其次，畏之。其次，侮之。信不足焉，有不信焉。悠兮其贵言，\r\n\r\n功成事遂，百姓皆谓∶我自然。\r\n\r\n \r\n\r\n18.大道废有仁义；慧智出有大伪；六亲不和有孝慈；国家昏乱有忠臣。\r\n\r\n \r\n\r\n19.绝圣弃智，民利百倍；绝仁弃义，民复孝慈；绝巧弃利，盗贼无有；此三者，以为文不足。故令有所\r\n\r\n属，见素抱朴少私寡欲。\r\n\r\n \r\n\r\n20.绝学无忧，唯之与阿，相去几何？善之与恶，相去若何？人之所畏，不可不畏。荒兮其未央哉！众人\r\n\r\n熙熙如享太牢、如春登台。我独泊兮其未兆，如婴儿之未孩；儡儡(羸弱)兮若无所归。众人皆有馀，而\r\n\r\n我独若遗。我愚人之心也哉！沌沌兮。俗人昭昭，我独昏昏；俗人察察，我独闷闷。众人皆有以，而我独\r\n\r\n顽且鄙。我独异於人，而贵食母。\r\n\r\n \r\n\r\n21.孔德之容惟道是从。道之为物惟恍惟惚。惚兮恍兮其中有象。恍兮惚兮其中有物。窈兮冥兮其中有精\r\n\r\n。其精甚真。其中有信。自古及今，其名不去以阅众甫。吾何以知众甫之状哉！以此。\r\n\r\n \r\n\r\n22.曲则全，枉则直，洼则盈，敝则新少则得，多则惑。是以圣人抱一为天下式。不自见故明；不自是故\r\n\r\n彰；不自伐故有功；不自矜故长；夫唯不争，故天下莫能与之争。古之所谓∶曲则全者」岂虚言哉！诚\r\n\r\n全而归之。\r\n\r\n \r\n\r\n23.希言自然。故飘风不终朝，骤雨不终日。孰为此者？天地。天地尚不能久，而况於人乎？故从事於道\r\n\r\n者，同於道。德者同於德。失者同於失。同於道者道亦乐得之；同於德者德亦乐得之；同於失者失於乐得\r\n\r\n之信不足焉有不信焉。\r\n\r\n \r\n\r\n24.企者不立；跨者不行。自见者不明；自是者不彰。自伐者无功；自矜者不长。其在道也曰∶馀食赘形\r\n\r\n。物或恶之，故有道者不处。\r\n\r\n \r\n\r\n25.有物混成先天地生。寂兮寥兮独立不改，周行而不殆，可以为天下母。吾不知其名，强字之曰道。强\r\n\r\n为之名曰大。大曰逝，逝曰远，远曰反。故道大、天大、地大、人亦大。域中有大，而人居其一焉。人法\r\n\r\n地，地法天，天法道，道法自然。\r\n\r\n \r\n\r\n26.重为轻根，静为躁君。是以君子终日行不离轻重。虽有荣观燕处超然。奈何万乘之主而以身轻天下。\r\n\r\n轻则失根，躁则失君。\r\n\r\n \r\n\r\n27.善行无辙迹。善言无瑕谪。善数不用筹策。善闭无关楗而不可开。善结无绳约而不可解。是以圣人常\r\n\r\n善救人，故无弃人。常善救物，故无弃物。是谓袭明。故善人者不善人之师。不善人者善人之资。不贵其\r\n\r\n师、不爱其资，虽智大迷，是谓要妙。\r\n\r\n \r\n\r\n28.知其雄，守其雌，为天下溪。为天下溪，常德不离，复归於婴儿。知其白，守其黑，为天下式。为天\r\n\r\n下式，常德不忒，复归於无极。知其荣，守其辱，为天下谷。为天下谷，常德乃足，复归於朴。朴散则为\r\n\r\n器，圣人用之则为官长。故大制不割。\r\n\r\n \r\n\r\n29.将欲取天下而为之，吾见其不得已。天下神器，不可为也，为者败之，执者失之。夫物或行或随、或\r\n\r\n觑或吹、或强或羸、或挫或隳。是以圣人去甚、去奢、去泰。\r\n\r\n \r\n\r\n30.以道佐人主者，不以兵强天下。其事好还。师之所处荆棘生焉。军之後必有凶年。善有果而已，不敢\r\n\r\n以取强。果而勿矜。果而勿伐。果而勿骄。果而不得已。果而勿强。物壮则老，是谓不道，不道早已。\r\n\r\n \r\n\r\n31.夫佳兵者不祥之器，物或恶之，故有道者不处。君子居则贵左，用兵则贵右。兵者不祥之器，非君子\r\n\r\n之器，不得已而用之，恬淡为上。胜而不美，而美之者，是乐杀人。夫乐杀人者，则不可得志於天下矣。\r\n\r\n吉事尚左，凶事尚右。偏将军居左，上将军居右。言以丧礼处之。杀人之众，以悲哀泣之，战胜以丧礼处\r\n\r\n之。\r\n\r\n \r\n\r\n32.道常无名。朴虽小天下莫能臣也。侯王若能守之，万物将自宾。天地相合以降甘露，民莫之令而自均\r\n\r\n。始制有名，名亦既有，夫亦将知止，知止可以不殆。譬道之在天下，犹川谷之於江海。\r\n\r\n \r\n\r\n33.知人者智，自知者明。胜人者有力，自胜者强。知足者富。强行者有志。不失其所者久。死而不亡者\r\n\r\n，寿。\r\n\r\n \r\n\r\n34.大道泛兮，其可左右。万物恃之以生而不辞，功成而不名有。衣养万物而不为主，常无欲可名於小。\r\n\r\n万物归焉，而不为主，可名为大。以其终不自为大，故能成其大。\r\n\r\n \r\n\r\n35.执大象天下往。往而不害安平太。乐与饵，过客止。道之出口淡乎其无味。视之不足见。听之不足闻\r\n\r\n。用之不足既。\r\n\r\n \r\n\r\n36.将欲歙之，必固张之。将欲弱之，必固强之。将欲废之，必固兴之。将欲取之，必固与之。是谓微明\r\n\r\n。柔弱胜刚强。鱼不可脱於渊，国之利器不可以示人。\r\n\r\n \r\n\r\n37.道常无为，而无不为。侯王若能守之，万物将自化。化而欲作，吾将镇之以无名之朴。无名之朴，夫\r\n\r\n亦将无欲。不欲以静，天下将自定。\r\n\r\n \r\n\r\n38.上德不德是以有德。下德不失德是以无德。上德无为而无以为。下德无为而有以为。上仁为之而无以\r\n\r\n为。上义为之而有以为。上礼为之而莫之以应，则攘臂而扔之。故失道而後德。失德而後仁。失仁而後义\r\n\r\n。失义而後礼。夫礼者忠信之薄而乱之首。前识者，道之华而愚之始。是以大丈夫，处其厚不居其薄。处\r\n\r\n其实，不居其华。故去彼取此。\r\n\r\n \r\n\r\n39.昔之得一者。天得一以清。地得一以宁。神得一以灵。谷得一以盈。万物得一以生。侯王得一以为天\r\n\r\n下贞。其致之。天无以清将恐裂。地无以宁将恐废。神无以灵将恐歇。谷无以盈将恐竭。万物无以生将恐\r\n\r\n灭。侯王无以贞将恐蹶。故贵以贱为本，高以下为基。是以侯王自称孤、寡、不谷。此非以贱为本邪？非\r\n\r\n乎。至誉无誉。不欲琭琭如玉，珞珞如石。\r\n\r\n \r\n\r\n40.反者道之动。弱者道之用。天下万物生於有，有生於无。\r\n\r\n \r\n\r\n41.上士闻道勤而行之。中士闻道若存若亡。下士闻道大笑之。不笑不足以为道。故建言有之。明道若昧\r\n\r\n。进道若退。夷道若纇。上德若谷。大白若辱。广德若不足。建德若偷。质真若渝。大方无隅。大器晚成\r\n\r\n。大音希声。大象无形。道隐无名。夫唯道善贷且成。\r\n\r\n \r\n\r\n42.道生一。一生二。二生三。三生万物。万物负阴而抱阳，冲气以为和。人之所恶，唯孤、寡不谷，而\r\n\r\n王公以为称，故物或损之而益，或益之而损。人之所教，我亦教之，强梁者，不得其死。吾将以为教父。\r\n\r\n \r\n\r\n43.天下之至柔，驰骋天下之至坚。无有入无间，吾是以知无为之有益。不言之教，无为之益天下希及之。\r\n\r\n \r\n\r\n44.名与身孰亲。身与货孰多。得与亡孰病。是故甚爱必大费。多藏必厚亡。知足不辱。知止不殆。可以\r\n\r\n长久。\r\n\r\n \r\n\r\n45.大成若缺，其用不弊。大盈若冲，其用不穷。大直若屈。大巧若拙。大辩若讷。静胜躁，寒胜热。清\r\n\r\n静为天下正。\r\n\r\n \r\n\r\n46.天下有道，却走马以粪。天下无道，戎马生於郊。祸莫大於不知足。咎莫大於欲得。故知足之足常足\r\n\r\n矣。\r\n\r\n \r\n\r\n47.不出户知天下。不窥牖见天道。其出弥远，其知弥少。是以圣人不行而知。不见而明。不为而成。\r\n\r\n \r\n\r\n48.为学日益。为道日损。损之又损，以至於无为。无为而不为。取天下常以无事，及其有事，不足以取\r\n\r\n天下。\r\n\r\n \r\n\r\n49.圣人无常心。以百姓心为心。善者吾善之。不善者吾亦善之，德善。信者吾信之。不信者吾亦信之，\r\n\r\n德信。圣人在天下，歙歙(无所偏执的样子)焉，为天下浑其心。百姓皆注其耳目，圣人皆孩之。\r\n\r\n \r\n\r\n50.出生入死。生之徒，十有三。死之徒，十有三。人之生，动之於死地，亦十有三。夫何故？以其生生\r\n\r\n之厚。盖闻善摄生者，陆行不遇凶虎，入军不被甲兵。凶无所投其角。虎无所用其爪。兵无所容其刃。夫\r\n\r\n何故？以其无死地。\r\n\r\n \r\n\r\n51.道生之，德畜之，物形之，势成之。是以万物莫不尊道，而贵德。道之尊，德之贵，夫莫之命而常自\r\n\r\n然。故道生之，德畜之。长之育之。亭之毒之。养之覆之。生而不有，为而不恃，长而不宰。是谓玄德。\r\n\r\n \r\n\r\n52.天下有始，以为天下母。既得其母，以知其子。既知其子，复守其母，没身不殆。塞其兑，闭其门，\r\n\r\n终身不勤。开其兑，济其事，终身不救。见其小曰明，守柔曰强。用其光，复归其明，无遗身殃。是为习\r\n\r\n常。\r\n\r\n \r\n\r\n53.使我介然有知，行於大道，唯施是畏。大道甚夷，而人好径。朝甚除，田甚芜，仓甚虚。服文彩，带\r\n\r\n利剑，厌饮食，财货有馀。是谓盗夸。非道也哉。\r\n\r\n \r\n\r\n54.善建者不拔。善抱者不脱。子孙以祭祀不辍。修之於身其德乃真。修之於家其德乃馀。修之於乡其德\r\n\r\n乃长。修之於邦其德乃丰。修之於天下其德乃普。故以身观身，以家观家，以乡观乡，以邦观邦，以天下\r\n\r\n观天下。吾何以知天下然哉？以此。\r\n\r\n \r\n\r\n55.含德之厚比於赤子。毒虫不螫，猛兽不据，攫鸟不抟。骨弱筋柔而握固。未知牝牡之合而全作，精之\r\n\r\n至也。终日号而不嗄，和之至也。知和曰常。知常曰明。益生曰祥。心使气曰强。物壮则老。谓之不道，\r\n\r\n不道早已。\r\n\r\n \r\n\r\n56.知者不言。言者不知。挫其锐，解其纷，和其光，同其尘，是谓玄同。故不可得而亲。不可得而疏。\r\n\r\n不可得而利。不可得而害。不可得而贵。不可得而贱。故为天下贵。\r\n\r\n \r\n\r\n57.以正治国，以奇用兵，以无事取天下。吾何以知其然哉？以此。天下多忌讳而民弥贫。民多利器国家\r\n\r\n滋昏。人多伎巧奇物泫起。法令滋彰盗贼多有。故圣人云我无为而民自化。我好静而民自正。我无事而民\r\n\r\n自富。我无欲而民自朴。\r\n\r\n \r\n\r\n58.其政闷闷，其民淳淳。其政察察，其民缺缺。祸尚福之所倚。福尚祸之所伏。孰知其极，其无正。正\r\n\r\n复为奇，善复为妖。人之迷其日固久。是以圣人方而不割。廉而不刿。直而不肆。光而不耀。\r\n\r\n \r\n\r\n59.治人事天莫若啬。夫唯啬是谓早服。早服谓之重积德。重积德则无不克。无不克则莫知其极。莫知其\r\n\r\n极可以有国。有国之母可以长久。是谓深根固柢，长生久视之道。\r\n\r\n \r\n\r\n60.治大国若烹小鲜。以道莅天下，其迨ㄞ哄非其鬼不神，其神不伤人。非其神不伤人，圣人亦不伤人。\r\n\r\n夫两不相伤，故德交归焉。\r\n\r\n \r\n\r\n61.大国者下流，天下之交。天下之牝。牝常以静胜牡。以静为下。故大国以下小国，则取小国。小国以\r\n\r\n下大国，则取大国。故或下以取，或下而取。大国不过欲兼畜人。小国不过欲入事人。夫两者各得所欲，\r\n\r\n大者宜为下。\r\n\r\n \r\n\r\n62.道者万物之奥。善人之宝，不善人之所保。美言可以市尊。美行可以加人。人之不善，何弃之有。故\r\n\r\n立天子、置三公，虽有拱璧以先驷马，不如坐进此道。古之所以贵此道者何。不曰∶求以得，有罪以免邪\r\n\r\n？故为天下贵。\r\n\r\n \r\n\r\n63.为无为，事无事，味无味。大小多少，报怨以德。图难於其易，为大於其细。天下难事必作於易。天\r\n\r\n下大事必作於细。是以圣人终不为大，故能成其大。夫轻诺必寡信。多易必多难。是以圣人犹难之，故终\r\n\r\n无难矣。\r\n\r\n \r\n\r\n64.其安易持，其未兆易谋。其脆易泮，其微易散。为之於未有，治之於未乱。合抱之木生於毫末。九层\r\n\r\n之台起於累土。千里之行始於足下。为者败之，执者失之。是以圣人无为故无败，无执故无失。民之从事\r\n\r\n常於几成而败之。慎终如始则无败事。是以圣人欲不欲，不贵难得之货。学不学，复众人之所过，以辅万\r\n\r\n物之自然而不敢为。\r\n\r\n \r\n\r\n65.古之善为道者，非以明民，将以愚之。民之难治，以其智多。故以智治国，国之贼。不以智治国，国\r\n\r\n之福。知此两者，亦稽式。常知稽式，是谓玄德。玄德深矣、远矣！与物反矣。然後乃至大顺。\r\n\r\n \r\n\r\n66.江海之所以能为百谷王者，以其善下之，故能为百谷王。是以圣人欲上民，必以言下之。欲先民，必\r\n\r\n以身後之。是以圣人处上而民不重，处前而民不害。是以天下乐推而不厌。以其不争，故天下莫能与之争。\r\n\r\n \r\n\r\n67.天下皆谓我道大似不肖。夫唯大故似不肖。若肖，久矣！其细也夫。我有三宝持而保之∶一曰慈， 二\r\n\r\n曰俭，三曰不敢为天下先。慈故能勇，俭故能广，不敢为天下先故能成器长。今舍慈且勇，舍俭且广，舍\r\n\r\n後且先，死矣！夫慈以战则胜，以守则固。天将救之以慈卫之。\r\n\r\n \r\n\r\n68.善为士者不武。善战者不怒。善胜敌者不与。善用人者为之下。是谓不争之德。是谓用人之力。是谓\r\n\r\n配天之极。\r\n\r\n \r\n\r\n69.用兵有言，吾不敢为主而为客。不敢进寸而退尺。是谓行无行。攘无臂。扔无敌。执无兵。祸莫大於\r\n\r\n轻敌。轻敌几丧吾宝。故抗兵相加哀者胜矣。\r\n\r\n \r\n\r\n70.吾言甚易知、甚易行。天下莫能知、莫能行。言有宗、事有君。夫唯无知，是以我不知。知我者希，\r\n\r\n则我者贵。是以圣被褐怀玉。\r\n\r\n \r\n\r\n71.知不知上，不知知病。夫唯病病，是以不病。圣人不病，以其病病。夫唯病病，是以不病。\r\n\r\n \r\n\r\n72.民不畏威，则大威至。无狎其所居，无厌其所生。夫唯不厌，是以不厌。是以圣人自知不自见。自爱\r\n\r\n不自贵。故去彼取此。\r\n\r\n \r\n\r\n73.勇於敢则杀。勇於不敢则活。此两者或利或害。天之所恶孰知其故。天之道不争而善胜。不言而善应\r\n\r\n。不召而自来。繟(舒缓)然而善谋。天网恢恢疏而不失。\r\n\r\n \r\n\r\n74.民不畏死，奈何以死惧之。若使民常畏死，而为奇者，吾得执而杀之，孰敢。常有司杀者杀。夫代司\r\n\r\n杀者杀，是谓代大匠斫。夫代大匠斫者，希有不伤其手矣。\r\n\r\n \r\n\r\n75.民之饥以其上食税之多，是以饥。民之难治以其上之有为，是以难治。民之轻死以其求生之厚，是以\r\n\r\n轻死。夫唯无以生为者，是贤於贵生。\r\n\r\n \r\n\r\n76.人之生也柔弱，其死也坚强。草木之生也柔脆，其死也枯槁。故坚强者死之徒，柔弱者生之徒。是以\r\n\r\n兵强则灭，木强则折。强大处下，柔弱处上。\r\n\r\n \r\n\r\n77.天之道其犹张弓与。高者抑之，下者举之。有馀者损之，不足者补之。天之道，损有馀而补不足。人\r\n\r\n之道，则不然，损不足以奉有馀。孰能有馀以奉天下，唯有道者。是以圣人为而不恃，功成而不处。其不\r\n\r\n欲见贤邪！\r\n\r\n \r\n\r\n78.天下莫柔弱於水。而攻坚强者，莫之能胜。以其无以易之。弱之胜强。柔之胜刚。天下莫不知莫能行\r\n\r\n。是以圣人云，受国之垢是谓社稷主。受国不祥是为天下王。正言若反。\r\n\r\n \r\n\r\n79.和大怨必有馀怨，安可以为善。是以圣人执左契，而不责於人。有德司契，无德司彻。天道无亲常与\r\n\r\n善人。\r\n\r\n \r\n\r\n80.小国寡民。使有什伯之器而不用。使民重死而不远徙。虽有舟舆无所乘之。虽有甲兵无所陈之。使民\r\n\r\n复结绳而用之。甘其食、美其服、安其居、乐其俗。邻国相望，鸡犬之声相闻。民至老死不相往来。\r\n\r\n \r\n\r\n81.信言不美。美言不信。善者不辩。辩者不善。知者不博。博者不知。圣人不积。既以为人己愈有。既\r\n\r\n以与人己愈多。天之道利而不害。圣人之道为而不争。','效法圣贤',NULL,NULL,'古来圣贤寂寞'),('2','20171213','140400','图片','塒NG\r\n\Z\n','鬼知道什么玩意儿',NULL,NULL,NULL),('20180109145903919','2018-01-09','14:59:03','2018年 01月 09日','','',NULL,NULL,';'),('20180109145917790','2018-01-09','14:59:17','2018年 01月 09日','###事务详解\r\n一、事务属性	原子性：	事务的原子性是指，在事务执行过程中任何失败都将导致该事物修改失效。（不可被分割。要么全部执行、要么全部不执行）\r\n		一致性：	当事务执行失败后，所有被该事务影响的数据都会恢复到该事务执行之前的状态。（在事务执行前后，数据状态保持一致性。同进退）\r\n		隔离性：	事务在执行过程中对数据的修改对其他事务不可见。（一个事务的执行不能被其他事务影响）\r\n		持久性：	事务一旦提交便永久保存在数据库中、既使此时回滚也不能撤销当前的更改。\r\n		\r\n		自动提交事务：	每条单独的语句都是一个事务。每个语句后都隐含一个commit。\r\n		显式事务：	以begin transaction显示开始，以commit或rollback结束。\r\n\r\n二、java中的事务类型\r\n	jdbc事务 ：connection对象控制的事务（自动提交、手动提交）一个jdbc事务只能从属于一个数据库，不能操作多个数据库连接。\r\n	jta事务  ：java transaction API \r\n	容器事务 ：\r\n\r\n三、事务并发可能引起的问题\r\n	脏读：		一个事务读取了另一个事务还未提交的数据。\r\n	不可重复读：	一个事务的操作导致另一个事务前后两次读取到不同的数据。\r\n	幻读：		一个事务的操作导致另一个事务前后两次查询的结果数据量不同。\r\n\r\n	例子：--A--B并发执行\r\n		脏读：		当A事务update后，B事务select读取到A尚未提交的数据，此时A事务rollback，则B读到的数据是无效的\"脏\"数据。\r\n		不可重复读：	当B事务select读取数据后，A事务update操作更改B事务select到的数据，此时B事务再次读去该数据，发现前后两次的数据不一样。\r\n		幻读：		当B事务select读取数据后，A事务insert或delete了一条满足A事务的select条件的记录，此时B事务再次select，发现查询到前次不存在的记录(\"幻影\")，或者前次的某个记录不见了。\r\n\r\n四、事务的隔离级别\r\n	TRANSACTION_NONE JDBC		驱动不支持事务\r\n	TRANSACTION_READ_UNCOMMITTED	读取未提交内容-----允许脏读、不可重复读和幻读。（事务最低的隔离级别，它充许令外一个事务可以看到这个事务未提交的数据）\r\n	TRANSACTION_READ_COMMITTED	读取提交内容-------禁止脏读，但允许不可重复读和幻读。（保证一个事务修改的数据提交后才能被另外一个事务读取。另外一个事务不能读取该事务未提交的数据）\r\n	TRANSACTION_REPEATABLE_READ	可重读-------------禁止脏读和不可重复读，单运行幻读。（它除了保证一个事务不能读取另一个事务未提交的数据外）\r\n	TRANSACTION_SERIALIZABLE	可串行化-----------禁止脏读、不可重复读和幻读。（花费最高代价但是最可靠的事务隔离级别）\r\n	\r\n\r\n五、事务的保存点 ：设置一个保存点以后，可以rollback到该保存点处的状态。这样可以避免回滚整个事务。\r\n	connection 接口的setsavepoint和releaseSavePoint方法可以设置和释放保存点。\r\n	\r\n\r\n六、事务的传播行为\r\n		1、PROPAGATION_REQUIRED：如果当前没有事务，就创建一个新事务，如果当前存在事务，就加入该事务，该设置是最常用的设置。\r\n\r\n		2、PROPAGATION_SUPPORTS：支持当前事务，如果当前存在事务，就加入该事务，如果当前不存在事务，就以非事务执行。‘\r\n\r\n		3、PROPAGATION_MANDATORY：支持当前事务，如果当前存在事务，就加入该事务，如果当前不存在事务，就抛出异常。\r\n\r\n		4、PROPAGATION_REQUIRES_NEW：创建新事务，无论当前存不存在事务，都创建新事务。\r\n\r\n		5、PROPAGATION_NOT_SUPPORTED：以非事务方式执行操作，如果当前存在事务，就把当前事务挂起。\r\n\r\n		6、PROPAGATION_NEVER：以非事务方式执行，如果当前存在事务，则抛出异常。\r\n\r\n		7、PROPAGATION_NESTED：如果当前存在事务，则在嵌套事务内执行。如果当前没有事务，则执行与PROPAGATION_REQUIRED类似的操作\r\n\r\n\r\n七、手动提交事务案例：处理高并发比较有用------最好在提交之后再把原来自动提交的事务改为自动提交。\r\n	\r\n	\r\n	private Connection conn = null;		//数据库连接对象\r\n	private PreparedStatement ps = null;	//执行sql对象。\r\n	try { \r\n\r\n	conn.setAutoCommit(false);	 //将自动提交设置为false \r\n	ps.executeUpdate(\"修改SQL\");	 //执行修改操作 \r\n	ps.executeQuery(\"查询SQL\");	 //执行查询操作 \r\n	conn.commit();			 //当两个操作成功后手动提交 \r\n	} catch (Exception e) { \r\n	conn.rollback();		 //一旦其中一个操作出错都将回滚，使两个操作都不成功 \r\n	e.printStackTrace(); \r\n	}','',NULL,NULL,';java事务总结.txt'),('20180109152050797','2018-01-09','15:20:50','名称测试。。。。。','生产环境\r\n	url: http://chanpin.metlife.com.cn/admin/login.do\r\n	用户名 ：admin\r\n	密码 ： shengchan2\r\n-----------------------------------------------------------------------------------------\r\n\r\nvdi\r\nhttp://vdi.metlife.com.cn/Citrix/StoreWeb/\r\nwangyi1/Jack_421\r\n\r\nsinosoft_songyd/Password1\r\n-----------------------------------------------------------------------------------------\r\n\r\n188目录：\r\n\\\\10.164.6.188\\FileServer02\\UAT\\iPartner\\songyandong\r\n\r\n -----------------------------------------------------------------------------------------\r\n\r\nipartner\r\nssh:Songyd&321\r\nDB:wangyi1/wangyi1\r\n\r\n-----------------------------------------------------------------------------------------\r\n \r\nicare\r\n	ssh:wangyi1\r\n\r\n-----------------------------------------------------------------------------------------\r\n\r\nURL ： \\\\10.164.6.188\r\n用户名 : alicocorp\\zhixin wang\r\n密码 ； Password1\r\n-----------------------------------------------------------------------------------------\r\n\r\n交行账号：\r\n	5229640717777475	111111\r\n	4349100717777577	111111\r\n\r\n	信用卡的动态码查询地址：\r\n	https://paymenttest.bankcomm.com/sandbox_gateway/ShopService/queryc.aspx\r\n\r\n-----------------------------------------------------------------------------------------\r\nUAT\r\n	URL: 10.164.25.37\r\n	用户名：root \r\n	密码：User123$ \r\n	tail -f /app/WebSphere/AppServer/profiles/AppSrv01/logs/IpartnerServer1/SystemOut.log\r\n\r\n\r\n-------------------------------------------------------------------------------------------------\r\n\r\ntfs\r\nLiBe\r\nHello001\r\n\r\n-------------------------------------------------------------------------------------------------\r\n\r\n\r\n邮箱域名：be.li@metlife.com			ben.li@metlife.com\r\nWebmail.metlife.com\r\n大都会邮箱地址：https://webmail2.o365.metlife.com/owa/auth/logon.aspx  \r\n用户名：Alico.corp\\libe\r\n密码：Hello001\r\n\r\n-------------------------------------------------------------------------------------------------\r\n\r\n网站 ：https://password.metlife.com/default/psf.exe#2\r\n用户名：3241348\r\n密码：Hello001\r\n\r\n\r\n-------------------------------------------------------------------------------------------------\r\nWebSphere——————ipay服务器重启\r\n\r\nhttps://10.164.25.37:9043/ibm/console/logon.jsp  \r\n用户名：wascsadmin\r\n密码：User123$','描述。。。。',NULL,NULL,'关键词。。。。;账号密码备忘.txt'),('20180109152215497','2018-01-09','15:22:15','名称测试。。。。。','###事务详解\r\n一、事务属性	原子性：	事务的原子性是指，在事务执行过程中任何失败都将导致该事物修改失效。（不可被分割。要么全部执行、要么全部不执行）\r\n		一致性：	当事务执行失败后，所有被该事务影响的数据都会恢复到该事务执行之前的状态。（在事务执行前后，数据状态保持一致性。同进退）\r\n		隔离性：	事务在执行过程中对数据的修改对其他事务不可见。（一个事务的执行不能被其他事务影响）\r\n		持久性：	事务一旦提交便永久保存在数据库中、既使此时回滚也不能撤销当前的更改。\r\n		\r\n		自动提交事务：	每条单独的语句都是一个事务。每个语句后都隐含一个commit。\r\n		显式事务：	以begin transaction显示开始，以commit或rollback结束。\r\n\r\n二、java中的事务类型\r\n	jdbc事务 ：connection对象控制的事务（自动提交、手动提交）一个jdbc事务只能从属于一个数据库，不能操作多个数据库连接。\r\n	jta事务  ：java transaction API \r\n	容器事务 ：\r\n\r\n三、事务并发可能引起的问题\r\n	脏读：		一个事务读取了另一个事务还未提交的数据。\r\n	不可重复读：	一个事务的操作导致另一个事务前后两次读取到不同的数据。\r\n	幻读：		一个事务的操作导致另一个事务前后两次查询的结果数据量不同。\r\n\r\n	例子：--A--B并发执行\r\n		脏读：		当A事务update后，B事务select读取到A尚未提交的数据，此时A事务rollback，则B读到的数据是无效的\"脏\"数据。\r\n		不可重复读：	当B事务select读取数据后，A事务update操作更改B事务select到的数据，此时B事务再次读去该数据，发现前后两次的数据不一样。\r\n		幻读：		当B事务select读取数据后，A事务insert或delete了一条满足A事务的select条件的记录，此时B事务再次select，发现查询到前次不存在的记录(\"幻影\")，或者前次的某个记录不见了。\r\n\r\n四、事务的隔离级别\r\n	TRANSACTION_NONE JDBC		驱动不支持事务\r\n	TRANSACTION_READ_UNCOMMITTED	读取未提交内容-----允许脏读、不可重复读和幻读。（事务最低的隔离级别，它充许令外一个事务可以看到这个事务未提交的数据）\r\n	TRANSACTION_READ_COMMITTED	读取提交内容-------禁止脏读，但允许不可重复读和幻读。（保证一个事务修改的数据提交后才能被另外一个事务读取。另外一个事务不能读取该事务未提交的数据）\r\n	TRANSACTION_REPEATABLE_READ	可重读-------------禁止脏读和不可重复读，单运行幻读。（它除了保证一个事务不能读取另一个事务未提交的数据外）\r\n	TRANSACTION_SERIALIZABLE	可串行化-----------禁止脏读、不可重复读和幻读。（花费最高代价但是最可靠的事务隔离级别）\r\n	\r\n\r\n五、事务的保存点 ：设置一个保存点以后，可以rollback到该保存点处的状态。这样可以避免回滚整个事务。\r\n	connection 接口的setsavepoint和releaseSavePoint方法可以设置和释放保存点。\r\n	\r\n\r\n六、事务的传播行为\r\n		1、PROPAGATION_REQUIRED：如果当前没有事务，就创建一个新事务，如果当前存在事务，就加入该事务，该设置是最常用的设置。\r\n\r\n		2、PROPAGATION_SUPPORTS：支持当前事务，如果当前存在事务，就加入该事务，如果当前不存在事务，就以非事务执行。‘\r\n\r\n		3、PROPAGATION_MANDATORY：支持当前事务，如果当前存在事务，就加入该事务，如果当前不存在事务，就抛出异常。\r\n\r\n		4、PROPAGATION_REQUIRES_NEW：创建新事务，无论当前存不存在事务，都创建新事务。\r\n\r\n		5、PROPAGATION_NOT_SUPPORTED：以非事务方式执行操作，如果当前存在事务，就把当前事务挂起。\r\n\r\n		6、PROPAGATION_NEVER：以非事务方式执行，如果当前存在事务，则抛出异常。\r\n\r\n		7、PROPAGATION_NESTED：如果当前存在事务，则在嵌套事务内执行。如果当前没有事务，则执行与PROPAGATION_REQUIRED类似的操作\r\n\r\n\r\n七、手动提交事务案例：处理高并发比较有用------最好在提交之后再把原来自动提交的事务改为自动提交。\r\n	\r\n	\r\n	private Connection conn = null;		//数据库连接对象\r\n	private PreparedStatement ps = null;	//执行sql对象。\r\n	try { \r\n\r\n	conn.setAutoCommit(false);	 //将自动提交设置为false \r\n	ps.executeUpdate(\"修改SQL\");	 //执行修改操作 \r\n	ps.executeQuery(\"查询SQL\");	 //执行查询操作 \r\n	conn.commit();			 //当两个操作成功后手动提交 \r\n	} catch (Exception e) { \r\n	conn.rollback();		 //一旦其中一个操作出错都将回滚，使两个操作都不成功 \r\n	e.printStackTrace(); \r\n	}','描述。。。。',NULL,NULL,'关键词。。。。;java事务总结.txt'),('20180118085111068','2018-01-18','08:51:11','2018年 01月 18日','2','',NULL,NULL,''),('20180118085804672','2018-01-18','08:58:04','éå¾·ç»','åªæ¨å¿æ¯å¤©é«ï¼å½.....','ä¸é¨éå®¶ç»å¸ä¹ä½',NULL,NULL,'æ å'),('20180118090127936','2018-01-18','09:01:27','西游记','鸿蒙初开天地先','四大名著之一',NULL,NULL,'吴承恩'),('20180122083822417','2018-01-22','08:38:22','双休日小感','2018骞�鏈�0鏃�  2018骞�鏈�1鏃�\n2018/1/22 闃村ぉ 閮ㄩ棬鑱氫細銆�\n2018/1/22 闃村ぉ 闄帀鑾夊幓KTV\r\n娓愭笎鍙戠幇鑷繁鐨勮兘鍔涗箣鏈夐檺锛屼粠涔犱織鏉ヨ缁撳蹇呴』瑕佹湁鎴垮瓙銆備粠鐪熷疄鎯呭喌鍑哄彂锛屾埧浠烽娑ㄦ牴鏈拱涓嶈捣鎴垮瓙銆傜粨鏋滃氨鏄凡缁忎簩鍗佸洓浜旂殑澶х敺浜猴紝鍗寸粨涓嶈捣濠氥�浠庤兘鍔涗笂鏉ヨ锛屾湁鐐瑰急浜嗭紝鎴樻枟鍔涗笉鍒颁簲銆傜劧鑰岋紝鎯宠鏀瑰彉杩欑鐘跺喌锛屽氨蹇呴』瑕佸姫鍔涳紝鍔犲�鍔姏鏂瑰彲鏀瑰彉鐜扮姸銆傚氨鐩墠鏉ヨ锛屾瘡姣忚捣搴婃棭涓�偣閮芥劅瑙夎嚜宸辨槸鍦ㄥ姫鍔涳紝濡傛灉璧峰簥涓嶆棭锛屽張璁や负鏄悊鎵�綋鐒躲�濡傛涓嬪幓鍝噷鑳藉鎴愬氨浠�箞浜嬩笟锛屼笉杩囨槸鑷娆轰汉缃簡銆�\n浠旂粏鎯虫潵瀛よ韩涓�汉锛岀瀹跺崈閲屻�杩欏凡缁忔槸鑾ぇ鐨勫媷姘斻�濡傛灉涓嶈兘澶熷湪澶栭潰鍒涘嚭涓�暘浜嬩笟锛屽張濡備綍鑳藉瀵瑰緱璧疯嚜宸憋紝瀵瑰緱璧烽偅浜涘叧蹇冭繃鑷繁锛屽張琚嚜宸卞叧蹇冭繃鐨勪汉銆傛棦鏄笉璇翠簩鍗佸嚑骞寸殑鍏昏偛涔嬫仼锛屽崟鍗曟槸涓�垎鏈熺浖銆佹垜宸茬粡鏃犳硶鍋胯繕銆�\n杩欎釜涓栫晫闈炲父鐜板疄锛屽氨鏍规湰涓婄殑瀵逛笌閿欒繕鏄瘮杈冩竻鏅般�鎵�互锛屽仛浜鸿鏈夎嚜宸辩殑鎯虫硶锛屽師鍒欎笂鐨勯棶棰樹箣澶栬灏藉彲鑳界殑鍦嗘粦锛屼笉浼や汉锛屼笉浼ゅ繁銆�\n瀵逛笉璧峰浜猴紝瀵逛笉璧疯帀鑾夈�','KTV 、吃饭、组聚餐、台球',NULL,NULL,'KTV 、吃饭、组聚餐、台球;190121.txt'),('20180122083834403','2018-01-22','08:38:34','双休日小感','2018年1月20日   2018年1月21日\r\n2018/1/22 阴天 部门聚会。\r\n2018/1/22 阴天 陪莉莉去KTV\r\n渐渐发现自己的能力之有限，从习俗来说结婚必须要有房子。从真实情况出发，房价飞涨根本买不起房子。结果就是已经二十四五的大男人，却结不起婚。从能力上来讲，有点弱了，战斗力不到五。然而，想要改变这种状况，就必须要努力，加倍努力方可改变现状。就目前来说，每每起床早一点都感觉自己是在努力，如果起床不早，又认为是理所当然。如此下去哪里能够成就什么事业，不过是自欺欺人罢了。\r\n仔细想来孤身一人，离家千里。这已经是莫大的勇气。如果不能够在外面创出一番事业，又如何能够对得起自己，对得起那些关心过自己，又被自己关心过的人。既是不说二十几年的养育之恩，单单是一分期盼、我已经无法偿还。\r\n这个世界非常现实，就根本上的对与错还是比较清晰。所以，做人要有自己的想法，原则上的问题之外要尽可能的圆滑，不伤人，不伤己。\r\n对不起家人，对不起莉莉。','KTV 、吃饭、组聚餐、台球',NULL,NULL,'KTV 、吃饭、组聚餐、台球;190121.txt'),('20180129083305264','2018-01-29','08:33:05','一周记事','凭什么？\r\n天下之大莫非王土、率土之滨莫非王臣。皇家的诞生只是一个制度的悲哀，凭什么拥有天下、或许仅仅是因为天下是他们祖先打下的。因为拥有了绝对的强权所有，他们拥有对某一个物品的定价权，也叫作所有权。可是就这个物品本身来说，是没有所谓的专属权，非要说有，那也是只能给那些需要的人。而当需要的人多于物品本身的时候，就会有争议，当争议大过一定的限度也就成了争端。而权力也就随之诞生，权力大的一方对某一物品拥有了定价权、所有权。这便是我眼中的皇家逻辑。\r\n可是，他们凭什么？对于某个人来说，不能因为有一些人能置他于死地，而屈服。正如皇帝有权利处死天下间任何一人，哪怕没有理由，甚至连接口都懒得拿出。可是他依然有权利。然而针对到个人来说，不能因为皇帝有权利处死而没有将自己处死而感恩戴德。如果那样做了，这便是典型的奴隶思维。这样的人活着也如同死去。','一月22 到一月28日小计',NULL,NULL,'部门聚会；本地虚拟机安装；皇权、凭什么');

/*Table structure for table `dict` */

CREATE TABLE `dict` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '自动增长的主键',
  `name` varchar(40) DEFAULT NULL COMMENT '约束的键',
  `value` varchar(100) DEFAULT NULL COMMENT '该键所代表的含义',
  `remark` varchar(150) DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8;

/*Data for the table `dict` */

insert  into `dict`(`id`,`name`,`value`,`remark`) values (1,'曾国藩','1001','晚清重臣'),(2,'凯文·米特尼克','usa01','15岁的米特尼克闯入了“北美空中防务指挥系统”的计算机主机内，他和另外一些朋友翻遍了美国指向前苏联及其盟国的所有核弹头的数据资料，然后又悄无声息地溜了出来。'),(3,'丹尼斯·利奇','usa02',' C语言之父，Unix（一种多用户的计算机操作系统）之父'),(4,'李纳斯','usa03',NULL),(5,'沃兹尼亚克','usa04',NULL),(6,'汤普生','usa05','里奇和汤普森在1969年创造了UNIX'),(7,'理查德·马修·斯托曼','usa06',NULL),(8,'德拉浦','usa07',NULL),(9,'雷蒙德','usa08',NULL),(10,'卡普尔','usa09',NULL),(11,'罗伯特·塔潘-莫里斯','usa10',NULL),(12,'生活','LIFE','节点信息'),(13,'学习','STUDY','节点信息'),(14,'系统','SYSTEM','节点信息'),(15,'工作','WORK','节点信息'),(16,'',NULL,NULL);

/*Table structure for table `menu_manage` */

CREATE TABLE `menu_manage` (
  `id` varchar(10) NOT NULL COMMENT '节点id',
  `pid` varchar(10) DEFAULT NULL COMMENT '父节点',
  `NAME` varchar(15) DEFAULT NULL COMMENT '节点名称',
  `url` varchar(50) DEFAULT NULL COMMENT '节点路径',
  `category` varchar(10) DEFAULT NULL COMMENT '节点类别',
  `isparent` varchar(2) DEFAULT NULL COMMENT '父节点标识',
  `isdisplay` varchar(2) DEFAULT NULL COMMENT '是否显示',
  `remark` varchar(40) DEFAULT NULL COMMENT '备注_暂且用来记录节点等级',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `menu_manage` */

insert  into `menu_manage`(`id`,`pid`,`NAME`,`url`,`category`,`isparent`,`isdisplay`,`remark`) values ('COMMON000','HIGHEST','公共信息',NULL,'COMMON','1','0','公共信息节点集'),('COMMON005','COMMON000','t4','t4','COMMON','0','0','t4'),('COMMON006','COMMON000','日程','rest/main/common/schedule.htm','COMMON','0','1','日程信息'),('COMMON007','COMMON000','待完成','main/comm/awaitList.do','COMMON','0','1','此处为代做事项'),('HIGHEST',NULL,'菜单节点集',NULL,'HIGHEST','1','0','菜单节点集'),('LIFE000','HIGHEST','生活','','LIFE','1','0','该节点仅仅为父节点标识'),('LIFE003','LIFE000','小记','rest/main/life/recordFortext.htm','LIFE','0','1','手写版日志'),('LIFE004','LIFE000','杂谈','rest/main/life/diary.htm','LIFE','0','1','该节点为公共节点'),('LIFE005','LIFE000','日记查询','rest/main/life/diaryForList.htm','LIFE','0','1','日记查询'),('STUDY000','HIGHEST','学习','','STUDY','1','0','该节点仅仅为父节点标识'),('SYSTEM000','HIGHEST','系统','','SYSTEM','1','0','该节点仅仅为父节点标识'),('SYSTEM001','SYSTEM000','菜单管理','rest/main/system/menuManage.htm','SYSTEM','0','1','系统菜单项管理'),('WORK000','HIGHEST','工作','','WORK','1','0','该节点仅仅为父节点标识');

/*Table structure for table `resume` */

CREATE TABLE `resume` (
  `RESUMEid` varchar(20) NOT NULL COMMENT '该信息的唯一标识',
  `NAME` varchar(10) DEFAULT NULL COMMENT '姓名',
  `sex` varchar(1) DEFAULT NULL COMMENT '性别',
  `age` int(11) DEFAULT NULL COMMENT '年龄',
  `address` varchar(50) DEFAULT NULL COMMENT '地址',
  `hobby` varchar(10) DEFAULT NULL COMMENT '爱好',
  `birthDate` varchar(20) DEFAULT NULL COMMENT '出生日期',
  `history` text COMMENT '人物生平',
  `tel` varchar(11) DEFAULT NULL COMMENT '手机号码',
  `email` varchar(50) DEFAULT NULL COMMENT '邮箱',
  `professional` varchar(20) DEFAULT NULL COMMENT '专业',
  `remark` text COMMENT '备注',
  PRIMARY KEY (`RESUMEid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `resume` */

/*Table structure for table `schedule` */

CREATE TABLE `schedule` (
  `id` varchar(20) NOT NULL COMMENT '主键',
  `createDate` varchar(20) DEFAULT NULL COMMENT '日程创建日期',
  `taskStartTime` varchar(20) DEFAULT NULL COMMENT '任务开始时间',
  `taskEndTime` varchar(20) DEFAULT NULL COMMENT '任务结束时间',
  `taskStartDate` varchar(20) DEFAULT NULL COMMENT '任务开始日期',
  `taskEndDate` varchar(20) DEFAULT NULL COMMENT '任务结束日期',
  `crateTime` varchar(20) DEFAULT NULL COMMENT '日程创建时间',
  `outline` text COMMENT '内容概要',
  `content` text COMMENT '日程内容',
  `finish` varchar(10) DEFAULT NULL COMMENT '完成日程标识',
  `sort` varchar(10) DEFAULT NULL COMMENT '日程类别',
  `isdelete` varchar(2) DEFAULT NULL COMMENT '删除标识',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `schedule` */

insert  into `schedule`(`id`,`createDate`,`taskStartTime`,`taskEndTime`,`taskStartDate`,`taskEndDate`,`crateTime`,`outline`,`content`,`finish`,`sort`,`isdelete`) values ('20180123164522','2018-01-24','00:00:00','00:00:00','2018-01-24','2018-01-27','10:50:46','redis缓存学习','学习redis缓存，历时三天;   2018/1/24 结果今天来晚了，什么也没学成。尴尬。','N','STUDY1','N');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
